Tekla Open API Reference for Tekla Structures 2025
CustomLineTypeCatalog.Get Method (Int32)
 Gets the CustomLineType with the specified ID.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static CustomLineType Get(
	int CustomLineTypeId
)
Public Shared Function Get (
	CustomLineTypeId As Integer
) As CustomLineType
Parameters
CustomLineTypeId
Type: System.Int32
The ID of the CustomLineType to fetch.
Return Value
Type: CustomLineType
The requested CustomLineType or null if not found.
See Also
Reference
CustomLineTypeCatalog Class
Get Overload
Tekla.Structures.Drawing Namespace